app/controllers/torneios_controller.rb

  def index
    @torneios = Torneio.all
---
SELECT "torneios".* FROM "torneios"